backend/tests/load/reports/test-.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: backend/tests/load/scenarios/production-50vu.js
        output: -

     scenarios: (100.00%) 2 scenarios, 15 max VUs, 20m30s max duration (incl. graceful stop):
              * podcast_production: 5 iterations shared among 5 VUs (maxDuration: 20m0s, exec: podcastFlow, gracefulStop: 30s)
              * tts_production: 10 iterations shared among 10 VUs (maxDuration: 20m0s, exec: ttsFlow, gracefulStop: 30s)

time="2026-02-07T20:50:17+03:00" level=info msg="[VU 2] TTS: Logging in as loadtest-0002@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 12] TTS: Logging in as loadtest-0012@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 11] Podcast: Logging in as loadtest-0041@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 10] Podcast: Logging in as loadtest-0040@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 6] TTS: Logging in as loadtest-0006@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 13] Podcast: Logging in as loadtest-0043@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 5] TTS: Logging in as loadtest-0005@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 3] TTS: Logging in as loadtest-0003@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 14] Podcast: Logging in as loadtest-0044@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 9] TTS: Logging in as loadtest-0009@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 15] Podcast: Logging in as loadtest-0045@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 4] TTS: Logging in as loadtest-0004@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 1] TTS: Logging in as loadtest-0001@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 8] TTS: Logging in as loadtest-0008@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 7] TTS: Logging in as loadtest-0007@loadtest.lingroot.com" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 14] Login failed for loadtest-0044@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 14] Podcast: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 5] Login failed for loadtest-0005@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 5] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 2] Login failed for loadtest-0002@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 2] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 7] Login failed for loadtest-0007@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 7] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 6] Login failed for loadtest-0006@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 6] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 11] Login failed for loadtest-0041@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 11] Podcast: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 12] Login failed for loadtest-0012@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 12] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 3] Login failed for loadtest-0003@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 3] TTS: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 15] Login failed for loadtest-0045@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 15] Podcast: Login failed, skipping" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 10] Login failed for loadtest-0040@loadtest.lingroot.com: 429 {\"success\":false,\"code\":\"RATE_LIMIT_EXCEEDED\",\"message\":\"Çok fazla giriş denemesi. 15 dakika sonra tekrar deneyin.\"}" source=console
time="2026-02-07T20:50:17+03:00" level=info msg="[VU 10] Podcast: Login failed, skipping" source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 8] TTS: Creating job..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 1] TTS: Creating job..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 9] TTS: Creating job..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 13] Podcast: Creating job for topic \"Travel and cultural exchange\"..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 4] TTS: Creating job..." source=console

running (00m01.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m01.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m01.0s/20m0s  06/10 shared iters
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 1] TTS: Job job_1770486618185_fp2jun1p1 created, polling..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 8] TTS: Job job_1770486618210_0r9x937q3 created, polling..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 9] TTS: Job job_1770486618211_057qzggmz created, polling..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 13] Podcast: Job job_1770486618211_8nkl2twy7 created, polling..." source=console
time="2026-02-07T20:50:18+03:00" level=info msg="[VU 4] TTS: Job job_1770486618251_5aitind4x created, polling..." source=console

running (00m02.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m02.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m02.0s/20m0s  06/10 shared iters

running (00m03.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m03.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m03.0s/20m0s  06/10 shared iters

running (00m04.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m04.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m04.0s/20m0s  06/10 shared iters

running (00m05.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m05.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m05.0s/20m0s  06/10 shared iters

running (00m06.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m06.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m06.0s/20m0s  06/10 shared iters

running (00m07.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m07.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m07.0s/20m0s  06/10 shared iters

running (00m08.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m08.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m08.0s/20m0s  06/10 shared iters

running (00m09.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m09.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m09.0s/20m0s  06/10 shared iters

running (00m10.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m10.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m10.0s/20m0s  06/10 shared iters

running (00m11.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m11.0s/20m0s  4/5 shared iters
tts_production       [  60% ] 10 VUs  00m11.0s/20m0s  06/10 shared iters
time="2026-02-07T20:50:28+03:00" level=info msg="[VU 1] TTS Job job_1770486618185_fp2jun1p1 failed: An internal server error occurred." source=console
time="2026-02-07T20:50:28+03:00" level=info msg="[JOB_DETAIL] {\"type\":\"tts\",\"jobId\":\"job_1770486618185_fp2jun1p1\",\"status\":\"failed\",\"duration_sec\":10,\"vu\":1}" source=console
time="2026-02-07T20:50:28+03:00" level=info msg="[VU 8] TTS Job job_1770486618210_0r9x937q3 failed: An internal server error occurred." source=console
time="2026-02-07T20:50:28+03:00" level=info msg="[JOB_DETAIL] {\"type\":\"tts\",\"jobId\":\"job_1770486618210_0r9x937q3\",\"status\":\"failed\",\"duration_sec\":10,\"vu\":8}" source=console
time="2026-02-07T20:50:28+03:00" level=info msg="[VU 9] TTS Job job_1770486618211_057qzggmz failed: An internal server error occurred." source=console
time="2026-02-07T20:50:28+03:00" level=info msg="[JOB_DETAIL] {\"type\":\"tts\",\"jobId\":\"job_1770486618211_057qzggmz\",\"status\":\"failed\",\"duration_sec\":10,\"vu\":9}" source=console

running (00m12.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m12.0s/20m0s  4/5 shared iters
tts_production       [  90% ] 10 VUs  00m12.0s/20m0s  09/10 shared iters

running (00m13.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m13.0s/20m0s  4/5 shared iters
tts_production       [  90% ] 10 VUs  00m13.0s/20m0s  09/10 shared iters

running (00m14.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m14.0s/20m0s  4/5 shared iters
tts_production       [  90% ] 10 VUs  00m14.0s/20m0s  09/10 shared iters

running (00m15.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m15.0s/20m0s  4/5 shared iters
tts_production       [  90% ] 10 VUs  00m15.0s/20m0s  09/10 shared iters

running (00m16.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m16.0s/20m0s  4/5 shared iters
tts_production       [  90% ] 10 VUs  00m16.0s/20m0s  09/10 shared iters
time="2026-02-07T20:50:33+03:00" level=info msg="[VU 4] TTS Job job_1770486618251_5aitind4x failed: An internal server error occurred." source=console
time="2026-02-07T20:50:33+03:00" level=info msg="[JOB_DETAIL] {\"type\":\"tts\",\"jobId\":\"job_1770486618251_5aitind4x\",\"status\":\"failed\",\"duration_sec\":15,\"vu\":4}" source=console

running (00m17.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m17.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m18.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m18.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m19.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m19.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m20.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m20.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m21.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m21.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m22.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m22.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m23.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m23.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m24.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m24.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m25.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m25.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m26.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m26.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m27.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m27.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m28.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m28.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m29.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m29.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m30.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m30.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m31.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m31.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m32.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m32.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m33.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m33.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m34.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m34.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m35.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m35.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters

running (00m36.0s), 01/15 VUs, 14 complete and 0 interrupted iterations
podcast_production   [  80% ] 5 VUs   00m36.0s/20m0s  4/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters
time="2026-02-07T20:50:54+03:00" level=info msg="[VU 13] PODCAST Job job_1770486618211_8nkl2twy7 failed: Invalid audio content type" source=console
time="2026-02-07T20:50:54+03:00" level=info msg="[JOB_DETAIL] {\"type\":\"podcast\",\"jobId\":\"job_1770486618211_8nkl2twy7\",\"status\":\"failed\",\"duration_sec\":36,\"vu\":13}" source=console


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.20' rate=27.77%

    job_completion_time
    ✓ 'p(95)<600000' p(95)=31790.4

    podcast_completion_time
    ✓ 'p(95)<600000' p(95)=35900

    tts_completion_time
    ✓ 'p(95)<180000' p(95)=14585.8


  █ TOTAL RESULTS 

    checks_total.......: 30     0.812351/s
    checks_succeeded...: 33.33% 10 out of 30
    checks_failed......: 66.66% 20 out of 30

    ✗ login status 200
      ↳  33% — ✓ 5 / ✗ 10
    ✗ login has token
      ↳  33% — ✓ 5 / ✗ 10

    CUSTOM
    job_completion_time............: avg=16390.6  min=10224    med=10244    max=35900    p(90)=27680.8  p(95)=31790.4 
    jobs_failed....................: 5      0.135392/s
    logins_failed..................: 10     0.270784/s
    podcast_completion_time........: avg=35900    min=35900    med=35900    max=35900    p(90)=35900    p(95)=35900   
    tts_completion_time............: avg=11513.25 min=10224    med=10238.5  max=15352    p(90)=13819.6  p(95)=14585.8 

    HTTP
    http_req_duration..............: avg=235.18ms min=92.89ms  med=136.35ms max=762.24ms p(90)=713.77ms p(95)=719.42ms
      { expected_response:true }...: avg=236.11ms min=92.89ms  med=122.18ms max=762.24ms p(90)=715.89ms p(95)=722.45ms
    http_req_failed................: 27.77% 10 out of 36
    http_reqs......................: 36     0.974821/s

    EXECUTION
    iteration_duration.............: avg=6.08s    min=395.79ms med=434.61ms max=36.92s   p(90)=14.34s   p(95)=22.56s  
    iterations.....................: 15     0.406176/s
    vus............................: 1      min=1        max=5 
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 101 kB 2.7 kB/s
    data_sent......................: 50 kB  1.4 kB/s



running (00m36.9s), 00/15 VUs, 15 complete and 0 interrupted iterations
podcast_production ✓ [ 100% ] 5 VUs   00m36.9s/20m0s  5/5 shared iters
tts_production     ✓ [ 100% ] 10 VUs  00m16.4s/20m0s  10/10 shared iters
time="2026-02-07T20:50:54+03:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"